Mejora los diagamas ASCII usando Mermaid
